package com.mido.yarmoukguide.userinterface.viewmodel

import androidx.lifecycle.ViewModel
import com.mido.yarmoukguide.data.FaqItem

class FaqViewModel: ViewModel(){
    val faqList: List<FaqItem> =  listOf(
        FaqItem(1, "كيف أسجل في الجامعة؟",
            "التسجيل يتم عبر بوابة الطالب الإلكترونية في بداية كل فصل دراسي. يجب عليك مراجعة التقويم الجامعي لمعرفة المواعيد الدقيقة."),
        FaqItem(2, "أين يقع مكتب شؤون الطلاب؟", "يقع مكتب شؤون الطلاب في مبنى الإدارة الرئيسي، الدور الثاني، مكتب رقم 204."),
        FaqItem(3, "كيف يمكنني الحصول على البطاقة الجامعية؟", "يمكنك استلام بطاقتك الجامعية من عمادة شؤون الطلبة بعد إتمام عملية التسجيل ودفع الرسوم."),
        FaqItem(4, "ما هي مواعيد عمل المكتبة؟", "المكتبة تفتح أبوابها من الساعة 8:00 صباحاً حتى الساعة 4:00 مساءً من الأحد إلى الخميس."),
        FaqItem(5, "هل يوجد سكن طلابي؟", "نعم، توفر الجامعة سكناً للطلاب والطالبات. يمكنك التقديم عبر موقع السكن الجامعي الرسمي.")
    )
}